###  Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

   subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.dynamic_subnets.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "private"
          + "Name"       = "private-use1a"
        }
      + tags_all                                       = {
          + "Attributes" = "private"
          + "Name"       = "private-use1a"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.dynamic_subnets.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "private"
          + "Name"       = "private-use1b"
        }
      + tags_all                                       = {
          + "Attributes" = "private"
          + "Name"       = "private-use1b"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.dynamic_subnets.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "public-use1a"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "public-use1a"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.dynamic_subnets.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Attributes" = "public"
          + "Name"       = "public-use1b"
        }
      + tags_all                                       = {
          + "Attributes" = "public"
          + "Name"       = "public-use1b"
        }
      + vpc_id                                         = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "20m"
        }
    }

  # module.ecs_alb_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "ecs-alb"
          + "Name"       = "ecs-alb"
        }
      + tags_all               = {
          + "Attributes" = "ecs-alb"
          + "Name"       = "ecs-alb"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ecs_alb_sg.aws_security_group_rule.keyed["HTTP"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTP from everywhere"
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.ecs_alb_sg.aws_security_group_rule.keyed["HTTPS"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS from everywhere"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.ecs_alb_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_alb_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.ecs_alb_sg.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = jsonencode(
                {
                  + HTTP               = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow HTTP from everywhere"
                      + from_port                = 80
                      + ipv6_cidr_blocks         = []
                      + key                      = "HTTP"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 80
                      + type                     = "ingress"
                    }
                  + HTTPS              = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow HTTPS from everywhere"
                      + from_port                = 443
                      + ipv6_cidr_blocks         = []
                      + key                      = "HTTPS"
                      + prefix_list_ids          = []
                      + protocol                 = "tcp"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 443
                      + type                     = "ingress"
                    }
                  + _allow_all_egress_ = {
                      + cidr_blocks              = [
                          + "0.0.0.0/0",
                        ]
                      + description              = "Allow all egress"
                      + from_port                = 0
                      + ipv6_cidr_blocks         = [
                          + "::/0",
                        ]
                      + key                      = "_allow_all_egress_"
                      + prefix_list_ids          = []
                      + protocol                 = "-1"
                      + security_groups          = []
                      + self                     = null
                      + source_security_group_id = null
                      + to_port                  = 0
                      + type                     = "egress"
                    }
                }
            )
        }
    }

  # module.ecs_service_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "ecs-primary"
          + "Name"       = "ecs-primary"
        }
      + tags_all               = {
          + "Attributes" = "ecs-primary"
          + "Name"       = "ecs-primary"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.ecs_service_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.ecs_service_sg.aws_security_group_rule.keyed["_m[0]#HTTPALB#sg#0"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + description              = "Allow HTTP from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.ecs_service_sg.aws_security_group_rule.keyed["_m[0]#OTHERS#sg#0"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + description              = "Allow non privileged ports"
      + from_port                = 31000
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 61000
      + type                     = "ingress"
    }

  # module.ecs_service_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.ecs_service_sg.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = (known after apply)
        }
    }

  # module.rds_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Attributes" = "rds-sg"
          + "Name"       = "rds-sg"
        }
      + tags_all               = {
          + "Attributes" = "rds-sg"
          + "Name"       = "rds-sg"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.rds_sg.aws_security_group_rule.keyed["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.rds_sg.aws_security_group_rule.keyed["_m[0]#ECSINGRESS#sg#0"] will be created
  + resource "aws_security_group_rule" "keyed" {
      + description              = "Allow ingress to mysql DB"
      + from_port                = 3306
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds_sg.null_resource.sync_rules_and_sg_lifecycles[0] will be created
  + resource "null_resource" "sync_rules_and_sg_lifecycles" {
      + id       = (known after apply)
      + triggers = {
          + "sg_ids" = (known after apply)
        }
    }

  # module.rds_sg.random_id.rule_change_forces_new_security_group[0] will be created
  + resource "random_id" "rule_change_forces_new_security_group" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "rules" = (known after apply)
        }
    }

  # module.vpc.aws_default_security_group.default[0] will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Name" = "-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.default[0] will be created
  + resource "aws_internet_gateway" "default" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_vpc.default[0] will be created
  + resource "aws_vpc" "default" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 71 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_id = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_acm_certificate.this will be created%0A  + resource "aws_acm_certificate" "this" {%0A      + arn                       = (known after apply)%0A      + domain_name               = "nisalikularatne.ca"%0A      + domain_validation_options = [%0A          + {%0A              + domain_name           = "*.nisalikularatne.ca"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A          + {%0A              + domain_name           = "nisalikularatne.ca"%0A              + resource_record_name  = (known after apply)%0A              + resource_record_type  = (known after apply)%0A              + resource_record_value = (known after apply)%0A            },%0A        ]%0A      + id                        = (known after apply)%0A      + key_algorithm             = (known after apply)%0A      + not_after                 = (known after apply)%0A      + not_before                = (known after apply)%0A      + pending_renewal           = (known after apply)%0A      + renewal_eligibility       = (known after apply)%0A      + renewal_summary           = (known after apply)%0A      + status                    = (known after apply)%0A      + subject_alternative_names = [%0A          + "*.nisalikularatne.ca",%0A          + "nisalikularatne.ca",%0A        ]%0A      + tags                      = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-cert"%0A        }%0A      + tags_all                  = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-cert"%0A        }%0A      + type                      = (known after apply)%0A      + validation_emails         = (known after apply)%0A      + validation_method         = "DNS"%0A    }%0A%0A  # aws_acm_certificate_validation.this will be created%0A  + resource "aws_acm_certificate_validation" "this" {%0A      + certificate_arn         = (known after apply)%0A      + id                      = (known after apply)%0A      + validation_record_fqdns = (known after apply)%0A    }%0A%0A  # aws_alb_listener.http will be created%0A  + resource "aws_alb_listener" "http" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_alb_listener.https will be created%0A  + resource "aws_alb_listener" "https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_alb_listener_rule.rule2 will be created%0A  + resource "aws_alb_listener_rule" "rule2" {%0A      + arn          = (known after apply)%0A      + id           = (known after apply)%0A      + listener_arn = (known after apply)%0A      + priority     = (known after apply)%0A      + tags_all     = (known after apply)%0A%0A      + action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + condition {%0A%0A          + path_pattern {%0A              + values = [%0A                  + "/pink",%0A                ]%0A            }%0A        }%0A    }%0A%0A  # aws_alb_target_group.blue will be created%0A  + resource "aws_alb_target_group" "blue" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "skills-tg-dev-blue"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-tg-dev-blue"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-tg-dev-blue"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/blue"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A    }%0A%0A  # aws_alb_target_group.pink will be created%0A  + resource "aws_alb_target_group" "pink" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "300"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "skills-tg-dev-pink"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-tg-dev-pink"%0A        }%0A      + tags_all                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-tg-dev-pink"%0A        }%0A      + target_type                        = "ip"%0A      + vpc_id                             = (known after apply)%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 3%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/pink"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 3%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A%0A      + target_failover {%0A          + on_deregistration = (known after apply)%0A          + on_unhealthy      = (known after apply)%0A        }%0A    }%0A%0A  # aws_appautoscaling_policy.this will be created%0A  + resource "aws_appautoscaling_policy" "this" {%0A      + alarm_arns         = (known after apply)%0A      + arn                = (known after apply)%0A      + id                 = (known after apply)%0A      + name               = "blue-service-scaling-policy"%0A      + policy_type        = "TargetTrackingScaling"%0A      + resource_id        = "service/skills-dev-cluster/skills-dev-service-blue"%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A%0A      + target_tracking_scaling_policy_configuration {%0A          + disable_scale_in = false%0A          + target_value     = 50%0A%0A          + predefined_metric_specification {%0A              + predefined_metric_type = "ECSServiceAverageCPUUtilization"%0A            }%0A        }%0A    }%0A%0A  # aws_appautoscaling_target.this will be created%0A  + resource "aws_appautoscaling_target" "this" {%0A      + id                 = (known after apply)%0A      + max_capacity       = 10%0A      + min_capacity       = 2%0A      + resource_id        = "service/skills-dev-cluster/skills-dev-service-blue"%0A      + role_arn           = (known after apply)%0A      + scalable_dimension = "ecs:service:DesiredCount"%0A      + service_namespace  = "ecs"%0A    }%0A%0A  # aws_cloudwatch_dashboard.main will be created%0A  + resource "aws_cloudwatch_dashboard" "main" {%0A      + dashboard_arn  = (known after apply)%0A      + dashboard_body = jsonencode(%0A            {%0A              + widgets = [%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + query  = <<-EOT%0A                                SOURCE '/aws/rds/instance/skills-dev-db/slowquery' | #fields  @message%0A                                 parse  @message "# Time: * User@Host: * Id: * Query_time: * Lock_time: * Rows_sent: * Rows_examined: * timestamp=*;*" %0A                                 as Time, User, Id, Query_time,Lock_time,Rows_sent,Rows_examined,timestamp,query%0A                                 | sort Time asc%0A                                 %0A                            EOT%0A                          + region = "us-east-1"%0A                          + title  = "Slow queries with detailed info"%0A                          + view   = "table"%0A                        }%0A                      + type       = "log"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 0%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + query  = <<-EOT%0A                                SOURCE '/aws/rds/instance/skills-dev-db/slowquery' | parse  @message "# Time: * User@Host: * Id: * Query_time: * Lock_time: * Rows_sent: * Rows_examined: * timestamp=*;*" %0A                                as Time, User, Id, Query_time,Lock_time,Rows_sent,Rows_examined,timestamp,Query %0A                                | display Time, Query_time, Query%0A                                | sort Query_time desc%0A                                 %0A                                %0A                            EOT%0A                          + region = "us-east-1"%0A                          + title  = "Top Slow Queries sorted by Query Time"%0A                          + view   = "table"%0A                        }%0A                      + type       = "log"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 6%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + metrics = [%0A                              + [%0A                                  + "AWS/RDS",%0A                                  + "ConnectionAttempts",%0A                                  + "DBInstanceIdentifier",%0A                                  + "skills-dev-db",%0A                                  + {%0A                                      + visible = false%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "RowLockTime",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "DMLLatency",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "InsertLatency",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "InsertThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + visible = false%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "Deadlocks",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                            ]%0A                          + period  = 60%0A                          + region  = "us-east-1"%0A                          + stacked = true%0A                          + stat    = "Average"%0A                          + view    = "timeSeries"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 18%0A                    },%0A                  + {%0A                      + height     = 9%0A                      + properties = {%0A                          + metrics = [%0A                              + [%0A                                  + "AWS/RDS",%0A                                  + "ConnectionAttempts",%0A                                  + "DBInstanceIdentifier",%0A                                  + "skills-dev-db",%0A                                  + {%0A                                      + visible = false%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "DatabaseConnections",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + stat = "Maximum"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "AbortedClients",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + visible = false%0A                                    },%0A                                ],%0A                            ]%0A                          + period  = 60%0A                          + region  = "us-east-1"%0A                          + stacked = true%0A                          + stat    = "Average"%0A                          + view    = "timeSeries"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 24%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + metrics = [%0A                              + [%0A                                  + "AWS/RDS",%0A                                  + "CPUUtilization",%0A                                  + "DBInstanceIdentifier",%0A                                  + "skills-dev-db",%0A                                ],%0A                            ]%0A                          + period  = 60%0A                          + region  = "us-east-1"%0A                          + stacked = true%0A                          + title   = "DB CPUUtilization"%0A                          + view    = "timeSeries"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 33%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + metrics = [%0A                              + [%0A                                  + "AWS/RDS",%0A                                  + "DMLThroughput",%0A                                  + "DBInstancceIdentifier",%0A                                  + "skills-dev-db",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "DeleteThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "InsertThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "UpdateThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "SelectThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "CommitThroughput",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                            ]%0A                          + region  = "us-east-1"%0A                          + stacked = true%0A                          + title   = "DB workLoad - CommitThroughput, DMLThroughput, DeleteThroughput, InsertThroughput, SelectThroughput, UpdateThroughput"%0A                          + view    = "timeSeries"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 39%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + query  = <<-EOT%0A                                SOURCE '/aws/rds/instance/skills-dev-db/error' | fields @message%0A                                | sort @timestamp desc%0A                                | limit 200%0A                            EOT%0A                          + region = "us-east-1"%0A                          + title  = "Top 200 lines of Error Log"%0A                          + view   = "table"%0A                        }%0A                      + type       = "log"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 12%0A                    },%0A                  + {%0A                      + height     = 9%0A                      + properties = {%0A                          + end       = "P0D"%0A                          + legend    = {%0A                              + position = "bottom"%0A                            }%0A                          + metrics   = [%0A                              + [%0A                                  + "AWS/EC2",%0A                                  + "CPUUtilization",%0A                                  + "InstanceId",%0A                                  + "i-0e8d66ed4385b0ec2",%0A                                  + {%0A                                      + id      = "m1"%0A                                      + stat    = "Average"%0A                                      + visible = false%0A                                    },%0A                                ],%0A                              + [%0A                                  + {%0A                                      + expression = "AVG([m1])"%0A                                      + id         = "e1"%0A                                      + label      = "us-east-1c"%0A                                      + region     = "us-east-1"%0A                                    },%0A                                ],%0A                              + [%0A                                  + "ECS/ContainerInsights",%0A                                  + "ContainerInstanceCount",%0A                                  + "ClusterName",%0A                                  + "skills-dev-cluster",%0A                                  + {%0A                                      + id = "m2"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "ServiceCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m3"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "TaskCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m4"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "CpuUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m5"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageWriteBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m6"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m7"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "CpuReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m8"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "EphemeralStorageUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m9"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkTxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m10"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "EphemeralStorageReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m11"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m12"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageReadBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m13"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkRxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m14"%0A                                    },%0A                                ],%0A                            ]%0A                          + period    = 300%0A                          + region    = "us-east-1"%0A                          + sparkline = true%0A                          + stacked   = true%0A                          + start     = "-PT3H"%0A                          + title     = "ECS Cluster Metrics"%0A                          + view      = "singleValue"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 45%0A                    },%0A                  + {%0A                      + height     = 24%0A                      + properties = {%0A                          + metrics = [%0A                              + [%0A                                  + "ECS/ContainerInsights",%0A                                  + "EphemeralStorageUtilized",%0A                                  + "ServiceName",%0A                                  + "skills-dev-service-blue",%0A                                  + "ClusterName",%0A                                  + "skills-dev-cluster",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkTxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "EphemeralStorageReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageReadBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkRxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "RunningTaskCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "PendingTaskCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageWriteBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "CpuUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "DeploymentCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "DesiredTaskCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "TaskSetCount",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                ],%0A                            ]%0A                          + region  = "us-east-1"%0A                          + title   = "Blue Service ECS cluster"%0A                          + view    = "gauge"%0A                          + yAxis   = {%0A                              + left = {%0A                                  + max = 2000%0A                                  + min = 0%0A                                }%0A                            }%0A                        }%0A                      + type       = "metric"%0A                      + width      = 24%0A                      + x          = 0%0A                      + y          = 54%0A                    },%0A                  + {%0A                      + height     = 6%0A                      + properties = {%0A                          + end     = "P0D"%0A                          + legend  = {%0A                              + position = "bottom"%0A                            }%0A                          + metrics = [%0A                              + [%0A                                  + "AWS/EC2",%0A                                  + "CPUUtilization",%0A                                  + "InstanceId",%0A                                  + "i-0e8d66ed4385b0ec2",%0A                                  + {%0A                                      + id      = "m1"%0A                                      + stat    = "Average"%0A                                      + visible = false%0A                                    },%0A                                ],%0A                              + [%0A                                  + {%0A                                      + expression = "AVG([m1])"%0A                                      + id         = "e1"%0A                                      + label      = "us-east-1c"%0A                                      + region     = "us-east-1"%0A                                    },%0A                                ],%0A                              + [%0A                                  + "ECS/ContainerInsights",%0A                                  + "CpuReserved",%0A                                  + "TaskDefinitionFamily",%0A                                  + "skills-dev-task-blue",%0A                                  + "ClusterName",%0A                                  + "skills-dev-cluster",%0A                                  + {%0A                                      + id = "m2"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "EphemeralStorageUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m3"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkTxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m4"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "EphemeralStorageReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m5"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m6"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageReadBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m7"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "NetworkRxBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m8"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "CpuUtilized",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m9"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "StorageWriteBytes",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m10"%0A                                    },%0A                                ],%0A                              + [%0A                                  + ".",%0A                                  + "MemoryReserved",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + ".",%0A                                  + {%0A                                      + id = "m12"%0A                                    },%0A                                ],%0A                            ]%0A                          + period  = 300%0A                          + region  = "us-east-1"%0A                          + stacked = false%0A                          + start   = "-PT3H"%0A                          + title   = "ECS Cluster blue task definition metrics"%0A                          + view    = "bar"%0A                        }%0A                      + type       = "metric"%0A                      + width      = 6%0A                      + x          = 0%0A                      + y          = 78%0A                    },%0A                ]%0A            }%0A        )%0A      + dashboard_name = "database-dashboard"%0A      + id             = (known after apply)%0A    }%0A%0A  # aws_cloudwatch_log_group.this will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + name              = "skills-dev-cloudwatch-log-group"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 0%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-cloudwatch-log-group"%0A        }%0A      + tags_all          = {%0A          + "Environment" = "dev"%0A          + "Name"        = "skills-dev-cloudwatch-log-group"%0A        }%0A    }%0A%0A  # aws_cloudwatch_log_stream.todo_container_cloudwatch_logstream will be created%0A  + resource "aws_cloudwatch_log_stream" "todo_container_cloudwatch_logstream" {%0A      + arn            = (known after apply)%0A      + id             = (known after apply)%0A      + log_group_name = "skills-dev-cloudwatch-log-group"%0A      + name           = "skills-dev-cloudwatch-log-stream"%0A    }%0A%0A  # aws_db_instance.this will be created%0A  + resource "aws_db_instance" "this" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 25%0A      + apply_immediately                     = (known after apply)%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade           
  ```
  </details>
  *Pusher: @nisalikularatne, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Deployment - Dev`*